# Dictionaries

## List

Q1. From the below list find the index value of "Mangoes" and then using the index value find the quantity of mangoes. (1 mark)

In [1]:
fruits = ["Apple", "Oranges", "Kiwi", "Mangoes", "Banana"]
Quantity = [7, 5, 10, 8, 3]

In [4]:
### START CODE HERE : 

inde=fruits.index('Mangoes')
Quantity[inde]

### END CODE

8

Since these is not so convenient method so instead we use dictionary

## Dictionary

Q1. From the below dictionary find the quantity of "Banana". (1 mark)

In [29]:
dict = {"Apple":7, "Oranges":5, "Kiwi":10, "Mangoes":8, "Banana":3}

### START CODE HERE : 

dict['Banana']

### END CODE

3

Q2. Add "Plum" fruit with quantity 15 in the dict. (1 mark)

In [30]:
### START CODE HERE : 

dict.update({"Plum":15})

### END CODE

Q3. Check if "Banana" is present in dict. (1 mark)

In [31]:
### START CODE HERE : 

dict



### END CODE

{'Apple': 7, 'Oranges': 5, 'Kiwi': 10, 'Mangoes': 8, 'Banana': 3, 'Plum': 15}

Q4. Delete "Banana" from dict. (1 mark)

In [32]:
### START CODE HERE : 

del dict["Banana"]

dict



### END CODE

{'Apple': 7, 'Oranges': 5, 'Kiwi': 10, 'Mangoes': 8, 'Plum': 15}

## Pandas

In [35]:
df = {
    "Name": ["aparna", "pankaj", "sudhir", "Geeku", "Chiku", "Jeniffer"], 
    "Degree": ["Bsc", "Engineering", "Law", "MBBS", "Phd", "Nursing"],
    "College": ["VIT", "IIT", "KIIT", "AIMS", "IIIT", "APPOLO"],
    "Score": [90, 70, 80, 98, 76, 89]}

Q1. Using pandas convert the above df into DataFrame and read it. (1 mark)

In [80]:
### START CODE HERE : 

import pandas as pd

data= pd.DataFrame(df)

data

### END CODE

       Name       Degree College  Score
0    aparna          Bsc     VIT     90
1    pankaj  Engineering     IIT     70
2    sudhir          Law    KIIT     80
3     Geeku         MBBS    AIMS     98
4     Chiku          Phd    IIIT     76
5  Jeniffer      Nursing  APPOLO     89

Q2. Change the index value to ("B", "E", "L", "M", "P", "N") respectively for the dict. (1 mark)

In [99]:
### START CODE HERE : 


data=data.set_index([pd.Index(["B", "E", "L", "M", "P", "N"])])

data



### END CODE

       Name       Degree College  Score
B    aparna          Bsc     VIT     90
E    pankaj  Engineering     IIT     70
L    sudhir          Law    KIIT     80
M     Geeku         MBBS    AIMS     98
P     Chiku          Phd    IIIT     76
N  Jeniffer      Nursing  APPOLO     89

Solve the following question for Column Access:
    
    a. Access the column Name. (1 mark)
    
    b. Find the type of the column Name (1 mark)
    
    c. Access two column (Name & Degree) at a time (1 mark)

In [100]:
### a. START CODE HERE : 

data["Name"]

### END CODE

B      aparna
E      pankaj
L      sudhir
M       Geeku
P       Chiku
N    Jeniffer
Name: Name, dtype: object

In [101]:
### b. START CODE HERE : 

print(data["Name"].dtypes)

### END CODE

object

In [102]:
### c. START CODE HERE : 

data[["Name" , "Degree"]]

### END CODE

       Name       Degree
B    aparna          Bsc
E    pankaj  Engineering
L    sudhir          Law
M     Geeku         MBBS
P     Chiku          Phd
N  Jeniffer      Nursing

Solve for Row Access:
    
    a. Access first three rows of dict. (1 mark)
    
    b. Access rows from second to fourth row. (1 mark)

In [103]:
### a. START CODE HERE : 

data[:2]



### END CODE

     Name       Degree College  Score
B  aparna          Bsc     VIT     90
E  pankaj  Engineering     IIT     70

In [104]:
### b. START CODE HERE : 

data[2:5]


### END CODE

     Name Degree College  Score
L  sudhir    Law    KIIT     80
M   Geeku   MBBS    AIMS     98
P   Chiku    Phd    IIIT     76

Use the **.loc** function to solve below questions:

   Q1. Access the **B** row. (1 mark)

   Q2. Access **B , M & L** row at once. (1 mark)

   Q3. Access **B , M** row & **Name , Score** column. (1 mark)

   Q4. Access all row with just **Name & Degree** column. (1 mark)

In [114]:
### Q1. START CODE HERE : 

data.loc[["B"]]

### END CODE

     Name Degree College  Score
B  aparna    Bsc     VIT     90

In [113]:
### Q2. START CODE HERE : 

data.loc[["B","M","L"]]

### END CODE

     Name Degree College  Score
B  aparna    Bsc     VIT     90
M   Geeku   MBBS    AIMS     98
L  sudhir    Law    KIIT     80

In [127]:
### Q3. START CODE HERE : 

data.loc[["B","M"] , ["Name" ,"Score"]]

### END CODE

     Name  Score
B  aparna     90
M   Geeku     98

In [142]:
### Q4. START CODE HERE : 
data.loc[:,["Name","Degree"]]

### END CODE

       Name       Degree
B    aparna          Bsc
E    pankaj  Engineering
L    sudhir          Law
M     Geeku         MBBS
P     Chiku          Phd
N  Jeniffer      Nursing

Use .iloc function to solve the following questions:

Q1. Access the 3rd row. (1 mark)

Q2. Access the first 3 row. (1 mark)

Q3. Access first 3 row and first 3 column.(1 mark)

Q4. Access all row with name & Degree column. (1 mark)

In [131]:
### Q1. START CODE HERE : 
data.iloc[[3]]

### END CODE

    Name Degree College  Score
M  Geeku   MBBS    AIMS     98

In [132]:
### Q2. START CODE HERE : 

data.iloc[:3]

### END CODE

     Name       Degree College  Score
B  aparna          Bsc     VIT     90
E  pankaj  Engineering     IIT     70
L  sudhir          Law    KIIT     80

In [136]:
### Q3. START CODE HERE : 

data.iloc[:3,:3]

### END CODE

     Name       Degree College
B  aparna          Bsc     VIT
E  pankaj  Engineering     IIT
L  sudhir          Law    KIIT

In [170]:
### Q4. START CODE HERE : 

name=data.columns.get_loc("Name")
degree=data.columns.get_loc("Degree")


data.iloc[:,[data.columns.get_loc("Name") ,data.columns.get_loc("Degree")]]


### END CODE

       Name       Degree
B    aparna          Bsc
E    pankaj  Engineering
L    sudhir          Law
M     Geeku         MBBS
P     Chiku          Phd
N  Jeniffer      Nursing